In [1]:
import pandas as pd

In [4]:
# var = [1,2,3,4]
# var2 = [5,6,7,8]
# var3 = pd.DataFrame(var,var2)
# var3

   0
5  1
6  2
7  3
8  4

In [5]:
var ={"A":[1,2,3,4],"B":[5,6,7,8]}
var2 = pd.DataFrame(var)
var2

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [10]:
var2.insert(1,"python_1",[9,10,11,12])
var2

   A  python_1  B
0  1         9  5
1  2        10  6
2  3        11  7
3  4        12  8

In [11]:
var2["python_12"] = var2["A"][:3]
var2

   A  python_1  B  python_12
0  1         9  5        1.0
1  2        10  6        2.0
2  3        11  7        3.0
3  4        12  8        NaN

# Delete

In [12]:
var1 = var2.pop("python_12")
var1

0    1.0
1    2.0
2    3.0
3    NaN
Name: python_12, dtype: float64

In [14]:
var2

   A  python_1  B
0  1         9  5
1  2        10  6
2  3        11  7
3  4        12  8

In [16]:
del var2["python_1"]
var2

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [24]:
var2

   B
0  5
1  6
2  7
3  8